---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.Dispose
source: html/d5959486-00d0-d89d-978d-89c916c6e1be.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams.Dispose Method

Releases all resources used by the StructuralSectionAnalysisParams

## Syntax (C#)
```csharp
public void Dispose()
```